---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewReferencePointArray
source: html/63d8f004-72d0-7882-8e27-59cf9c9c8297.htm
---
# Autodesk.Revit.Creation.Application.NewReferencePointArray Method

Creates an empty array that can store ReferencePoint objects.

## Syntax (C#)
```csharp
public ReferencePointArray NewReferencePointArray()
```

## Returns
An empty array that can hold ReferencePoint objects.

## Remarks
This method can be used to create an array that can hold ReferencePoint objects. This
array can be then passed to methods, such as NewCurveByPoints, to represent two or more PointElements.